Revit 2024 API
ParameterTypeId.RebarSystemNumberOfLinesTopDirn1 Property
 "Top Major Number Of Lines"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarSystemNumberOfLinesTopDirn1 { get; }
Visual Basic
Public Shared ReadOnly Property RebarSystemNumberOfLinesTopDirn1 As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarSystemNumberOfLinesTopDirn1 {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace